lib_app/app/controllers/libraries_controller.rb

  def create
    @library = Library.create(library_params)
---
INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "1"], ["floor_count", 1], ["floor_area", 1], ["created_at", "2016-08-16 20:59:05.519951"], ["updated_at", "2016-08-16 20:59:05.519951"]]

  def show
    p @library
    @library = Library.find_by_id(params[:id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 2]]

  def edit
    @library = Library.find_by_id(params[:id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @library = Library.find_by_id(params[:id])
    @library.update(library_params)
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "libraries" SET "name" = $1, "updated_at" = $2 WHERE "libraries"."id" = $3  [["name", "12"], ["updated_at", "2016-08-16 21:11:45.488297"], ["id", 1]]

  def destroy
    library = Library.find_by_id(params[:id])
    library.destroy
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "libraries" WHERE "libraries"."id" = $1  [["id", 2]]